C++/qtbuildnotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Building Qt with VS2013</title>
<!-- 2016-01-23 Sat 14:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Building Qt with VS2013</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Setting up Qt accounts</a></li>
<li><a href="#sec-3">Getting source code</a></li>
<li><a href="#sec-4">Ensuring dependencies are in place</a></li>
<li><a href="#sec-5">Configuring the source code tree</a></li>
<li><a href="#sec-6">Building the source code</a>
<ul>
<li><a href="#sec-6-1">Creating the environment script</a></li>
<li><a href="#sec-6-2">Configuring the build</a></li>
</ul>
</li>
<li><a href="#sec-7">Upgrading an old solution to use the new Qt build</a>
<ul>
<li><a href="#sec-7-1">Missing DLLs</a></li>
<li><a href="#sec-7-2">Environment Variables</a></li>
<li><a href="#sec-7-3">Qt Creator</a></li>
<li><a href="#sec-7-4">Running qmake from command line</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to build Qt from source and contribute to the Qt
development process, there are quite a few hoops that need to be
jumped through. These notes outline the process I went through to
get Qt building, under Windows with Visual Studio 2013 as the
toolset. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Setting up Qt accounts</h2>
<div class="outline-text-2" id="text-2">
<p>
The first place to go to is the <a href="https://wiki.qt.io/Qt_Contribution_Guidelines">Qt Contribution Guidelines</a>, where
the whole process of contributing to Qt is outlined. This is a
little outdated and at the time of writing the Qt login procedure is
being changed.
</p>

<p>
The first step though is to set up a Qt account at <a href="https://login.qt.io/register">this link</a>. I
recently received an email saying that all further login would be
done through a single sign on based on these login credentials.
</p>

<p>
However, at this stage, it still appears you need to create account
on both the <a href="https://bugreports.qt.io/secure/Signup!default.jspa">bug reports site</a> AND then log into<a href="http://codereview.qt-project.org/#settings,contact"> The Gerrit Code
Review System</a> to create details for that as well. Both of these
account creation procedures involve as confirmation email.
</p>

<p>
In order to contribute to Qt you will need to set up an SSL key for
committing to the code review system. If you already use git, then
this should probably be the key you use for git, and can be added to
gerrit <a href="https://codereview.qt-project.org/#/settings/ssh-keys">here</a>.
</p>

<p>
To get the public key for pasting into the web page, form a bash shell:
</p>

<div class="org-src-container">

<pre class="src src-sh">cat ~/.ssh/id_rsa.pub
</pre>
</div>

<p>
Select and paste the whole string into the box to register this key.
</p>

<p>
You should now be set up to contribute to the Qt development process.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Getting source code</h2>
<div class="outline-text-2" id="text-3">
<p>
The source code is kept in a git repository and should be cloned in
a suitable location, preferably one on a fast local disk, as the
build process can take a long time.
</p>

<p>
To get the top level code:
</p>

<div class="org-src-container">

<pre class="src src-sh">git clone git://code.qt.io/qt/qt5.git
</pre>
</div>

<p>
This is very quick, do not be fooled, the code has not really been
pulled down yet!
</p>

<p>
Now we need to check out the target branch.
</p>

<p>
IMPORTANT - If you switch branches, you should go through the whole
procedure again from here.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #859900;">cd</span> qt5
git checkout dev
</pre>
</div>

<p>
We should now check that we have all the dependencies for the build
in place before proceeding further.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Ensuring dependencies are in place</h2>
<div class="outline-text-2" id="text-4">
<p>
In order to build, we need to ensure that we have:
</p>

<ul class="org-ul">
<li>Perl &gt;= 5.14
</li>
<li>Python &gt;= 2.6.x
</li>
</ul>

<p>
These are the basic dependencies and depending upon ssl and webkit
requirements, there might be more needed. Details of these can be
found on the main <a href="https://wiki.qt.io/Building-Qt-5-from-Git">building from git</a> page.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Configuring the source code tree</h2>
<div class="outline-text-2" id="text-5">
<p>
To configure the source code tree, I use the bash shell. The
following commands should configure the the Qt source code for
building and contributing:
</p>

<div class="org-src-container">

<pre class="src src-sh">perl init-repository --codereview-username &lt;gerrit username&gt;
</pre>
</div>

<p>
I got an error from this command due to my default version of perl,
part of the git distribution being out of date so had to use an
absolute path to a later perl version in Program Files.
</p>

<p>
This configures all the git submodules for Qt and checks out the
code. This can take a while to check out, but we now have all the
source ready to build.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Building the source code</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Creating the environment script</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Before we build, we must create a script file called qt5vars.cmd
containing the following:
</p>

<div class="org-src-container">

<pre class="src src-bat"><span id="coderef-edit" class="coderef-off"><span class="linenr">1: </span><span style="color: #859900;">SET</span> _ROOT=X:\dev\libs\qt5</span>
<span class="linenr">2: </span><span style="color: #859900;">SET</span> <span style="color: #268bd2;">PATH</span>=%_ROOT%\qtbase\bin;%_ROOT%\gnuwin32\bin;%<span style="color: #268bd2;">PATH</span>%
<span class="linenr">3: </span><span style="color: #586e75; font-style: italic;">REM Uncomment the below line when using a git checkout of the source repository</span>
<span class="linenr">4: </span><span style="color: #586e75; font-style: italic;">REM SET PATH=%_ROOT%\qtrepotools\bin;%PATH%</span>
<span class="linenr">5: </span><span style="color: #859900;">SET</span> <span style="color: #268bd2;">QMAKESPEC</span>=win32-msvc2013
<span class="linenr">6: </span><span style="color: #859900;">SET</span> _ROOT=
</pre>
</div>

<p>
this should be placed in the folder containing the qt5 source, at
the top level. And the <a href="#coderef-edit"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-edit');" onmouseout="CodeHighlightOff(this, 'coderef-edit');">_ROOT</a> variable set to the correct location of
the Qt source. 
</p>

<p>
This can then be called from a command prompt before building the
source.
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Configuring the build</h3>
<div class="outline-text-3" id="text-6-2">
<p>
In order to configure the build without tests. examples and webkit,
open a VS2014 64bit command prompt, navigate to the source folder,
execute the qt5vars.cmd script above and then run the following
command:
</p>

<div class="org-src-container">

<pre class="src src-bat">configure -<span style="color: #b58900;">skip</span> webkit -<span style="color: #b58900;">developer</span>-build -<span style="color: #b58900;">opensource</span> -<span style="color: #b58900;">nomake</span> tests \
          -<span style="color: #b58900;">nomake</span> examples -<span style="color: #b58900;">debug</span>-and-release
</pre>
</div>

<p>
You will be asked to accept the opensource license terms.
</p>

<p>
This will set up the build chain, makefiles etc for the build,
which can then be executed with the following command:
</p>

<div class="org-src-container">

<pre class="src src-bat">nmake
</pre>
</div>

<p>
Once the build process has finished, there will be both a debug and
a release version of the Qt libraries in ./qtbase under the root
source folder.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Upgrading an old solution to use the new Qt build</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Missing DLLs</h3>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Environment Variables</h3>
<div class="outline-text-3" id="text-7-2">
<p>
In order to use the new version of Qt, firstly any environment
variables set up should be changed to reflect the new path. The ones
I had to change were:
</p>

<ul class="org-ul">
<li>QT5<sub>X64DIR</sub>
</li>
<li>QT5DIR
</li>
<li>QTDIR
</li>
</ul>

<p>
These were all changed to the qtbase folder as mentioned in the
previous section.
</p>

<p>
Also if Qt5 DLLs are present on the PATH, then these may interfere
with running applications using the new Qt build. 
</p>

<p>
In order to preempt this I added %QT5<sub>X64DIR</sub>%/bin to the PATH and
made sure it took precedence.
</p>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Qt Creator</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Building a project in Qt Creator should be as simple as opening the
project as before, selecting the Projects icon on the right and
adding a new kit using the Manage Kits button, based on the
location of the Qt build.
</p>

<p>
First, use the Qt Versions tab to add a new Qt version by selecting
the qmake.exe in the bin folder, then switch to the Kits tab, in
order to add a new kit based on the Qt Version by selecting the
qtbase folder in the source folder and the correct Qt
version. Ensure that it is named something sensible and close the
dialog.
</p>

<p>
Then select the Add Kit button and choose the kit created
above. This then creates a build configuration based on the new
version of Qt.
</p>

<p>
Run qmake and build from the menu and run the application. No other
changes should be necessary.
</p>
</div>
</div>


<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">Running qmake from command line</h3>
<div class="outline-text-3" id="text-7-4">
<p>
qmake should now work from the command line. In my project we have
a small batch script that runs qmake to generate Visual Studio
projects. This needed no changing to generate the visual studio
projects and created them with correct paths for include and lib
settings as well as moc, uic and rcc execution.
</p>

<p>
Building the project in visual studio 2013 worked as expected in
both Release and Debug builds.
</p>

<p>
Running the executable from Visual Studio needs no extra changes as
qmake has ensured everything is updated.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-01-23 Sat 14:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
